src/Catalogs/ХранилищеДанныхФорм/ХранилищеДанныхФорм.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ХранилищеДанныхФорм</name>
  <attributes>
    <name>КлючОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеФормы</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/SettingsStorages/НастройкиФорм/ManagerModule.bsl
Процедура ОбработкаСохранения(КлючОбъекта, КлючНастроек, Настройки, ОписаниеНастроек, Пользователь)
	ХранилищеДанныхФорм = Справочники.ХранилищеДанныхФорм.НайтиПоКоду(КлючНастроек).ПолучитьОбъект();
	ХранилищеДанныхФорм.ДанныеФормы = Новый ХранилищеЗначения(Настройки, Новый СжатиеДанных(9));
	ХранилищеДанныхФорм.Записать();
КонецПроцедуры

Процедура ОбработкаЗагрузки(КлючОбъекта, КлючНастроек, Настройки, ОписаниеНастроек, Пользователь)
	ХранилищеДанныхФорм = Справочники.ХранилищеДанныхФорм.НайтиПоКоду(КлючНастроек);
	Настройки = ХранилищеДанныхФорм.ДанныеФормы.Получить();
КонецПроцедуры
